app/controllers/organization_resources_controller.rb

	def index
    contact_point = ContactPoint.from_hash(params.require(:contact_point)) if params[:contact_point].present?

    organization = if contact_point && params['organization']['uniqueid'] == "anyone_org_option"
		  user = User.find_user(contact_point).first
      user ? user.default_org : nil
    else
      Organization.by_uniqueid(params['organization']['uniqueid']).first || Organization.by_name(params['organization']['uniqueid']).first
    end

    if organization
		  resources = OrganizationResource.where(organization: organization, visibility: "public" )
---
SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`uniqueid` = 'fasial' ORDER BY `organizations`.`id` ASC LIMIT 1
SELECT `organization_resources`.* FROM `organization_resources` WHERE `organization_resources`.`organization_id` = 22 AND `organization_resources`.`visibility` = 'public'

  def find_or_create
    # if there's no Org Data then we use the author's default org resource
    org_resource = if params[:uniqueid].blank?
      current_user.default_org_resource
    else
      # we create the organization if it's a new one. Otherwise we use the existing one passed through params
      organization = if params[:created].present? # it's a new Organization
        Organization.create_by_name_and_user!(params[:name], current_user, 'private', params[:orguser])
      else # it's an existing Organization (no matter if it's with existing or new resource)
        current_user.organizations.find_by!(uniqueid: params[:uniqueid])
      end

      resource_name = OrganizationResource.resource_default_name(params[:resource])
      OrganizationResource.find_or_create_within_org(organization, resource_name)
---
SELECT `organizations`.* FROM `organizations` INNER JOIN `organization_users` ON `organizations`.`id` = `organization_users`.`organization_id` WHERE `organization_users`.`user_id` = 22 AND `organizations`.`uniqueid` = 'fasial' LIMIT 1
SELECT `organization_resources`.* FROM `organization_resources` WHERE `organization_resources`.`organization_id` = 22 AND `organization_resources`.`name` = 'fasial' ORDER BY `organization_resources`.`id` ASC LIMIT 1