app/controllers/organization_users_controller.rb

  def index
    contact_point = ContactPoint.from_hash(params.require(:contact_point)) if params[:contact_point].present?
    organization  = if contact_point && params['organization']['uniqueid'] == "anyone_org_option"
      user = User.find_user(contact_point).first
      user ? user.default_org : nil
    else
      Organization.by_uniqueid(params['organization']['uniqueid']).first
    end

    if organization && current_user
      org_user  = OrganizationUser.where(organization: organization, user: current_user).first
---
SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`uniqueid` = 'fasial' ORDER BY `organizations`.`id` ASC LIMIT 1
SELECT `organization_users`.* FROM `organization_users` WHERE `organization_users`.`organization_id` = 22 AND `organization_users`.`user_id` = 22 ORDER BY `organization_users`.`id` ASC LIMIT 1