app/controllers/organizations_controller.rb

  def trusted
    organizations = current_user.manageable_organizations.order(:name)
    # if there's a params[:resource_id] then it means we want to exclude orgs that already manage that 'resource_id'
    if params[:resource_id]
      orgs_table = Arel::Table.new(:organizations)
      ids_to_exclude = OrganizationResource.where(resource_id: params[:resource_id]).pluck(:organization_id)
      organizations = current_user.manageable_organizations.where(orgs_table[:id].not_in ids_to_exclude).compact.uniq
    end
    # if we have the flag params[:only_with_resources] then it means we want orgs that have at least one resource
    if params[:only_with_resources]
      organizations = organizations.reject{|org| org.resources.blank?}
---
SELECT `resources`.* FROM `resources` INNER JOIN `organization_resources` ON `resources`.`id` = `organization_resources`.`resource_id` WHERE `organization_resources`.`organization_id` = 22