app/controllers/registrations_controller.rb

INSERT INTO `resources` (`created_at`, `name`, `uniqueid`, `updated_at`) VALUES ('2014-08-07 05:26:37', 'Faisal', 'faisal', '2014-08-07 05:26:37')
---
  def create
    build_resource(sign_up_params)

    if resource.save